Repository: Bat-cyla/ideal-guide
Catalog: var/langs/*/addons/cp_email_verification.po
Languages: ru_ru

# Addons::name::cp_email_verification
source: Cart-Power: Email verification for Users and Vendors
ru_ru: Cart-Power: Верификация Email для пользователей и вендоров

# Addons::description::cp_email_verification
source: The module allows you to verify the user's e-mail when registering and placing a guest order. Developed by <a href='https://cart-power.com'>Cart-Power</a>
ru_ru: Модуль позволяет верифицировать E-mail пользователя при регистрации и оформлении гостевого заказа. Developed by <a href='https://cart-power.com'>Cart-Power</a>

# SettingsSections::cp_email_verification::general
source: General
ru_ru: Основные

# SettingsOptions::cp_email_verification::licensekey
source: License key
ru_ru: Лицензионный ключ

# Languages::cp_your_license_is_not_valid
source: You should enter valid License Key. Please, contact us (sales@cart-power.com), if you face any issues.
ru_ru: Вы должны ввести актуальный ключ. Пожалуйста, свяжитесь с нами (sales@cart-power.com), если вы столкнетесь с какими то проблемами.

# SettingsOptions::cp_email_verification::verification_vendor_admins
source: Enable vendor admin verification
ru_ru: Включить верификацию администраторов продавца

# SettingsOptions::cp_email_verification::аuthorization_without_verification
source: Allow authorization with unconfirmed email
ru_ru: Разрешить авторизацию с неподтвержденным адресом электронной почты

# SettingsOptions::cp_email_verification::verification_guest_orders
source: Enable verification for guest orders
ru_ru: Включить верификацию для гостевых заказов

# SettingsOptions::cp_email_verification::link_verification_lifetime
source: Account activation link lifetime (N hours)
ru_ru: Срок жизни ссылки на активацию аккаунта (N часов)

# SettingsOptions::cp_email_verification::link_verification_timer
source: Resend link after (N seconds)
ru_ru: Отправить ссылку повторно через (N секунд)

# SettingsOptions::cp_email_verification::delete_not_verification_account
source: Delete unconfirmed accounts without orders
ru_ru: Удалять неподтвержденные аккаунты без заказов

# SettingsOptions::cp_email_verification::verified_old_accounts
source: User accounts created before installation of the module are considered confirmed
ru_ru: Аккаунты пользователей созданные до установки модуля считать подтвержденными

# SettingsOptions::cp_email_verification::dont_delete_old_accounts
source: Do not delete accounts created before installation of the module
ru_ru: Не удалять аккаунты созданные до установки модуля

# SettingsOptions::cp_email_verification::delete_users_verification_data
source: Remove users email verification data
ru_ru: Удалить данные о верификации электронной почты пользователей

# SettingsOptions::cp_email_verification::cron_password
source: CRON password
ru_ru: Пароль для запуска команды по расписанию

# SettingsOptions::cp_email_verification::delete_after_time
source: Delete unconfirmed accounts without orders(days)
ru_ru: Удалять неподтвержденные аккаунты без заказов(дней)

# Languages::cp_email_verification.try_manually
source: Start manually
ru_ru: Запустить вручную

# Languages::cp_email_verification.delete_unconfirmed_accounts_without_orders
source: Delete unconfirmed accounts without orders
ru_ru: Удаление неподтвержденных аккаунтов без заказов

# Languages::cp_email_verification.cron_delete_unconfirmed_accounts_without_orders
source: Use this script to delete unconfirmed accounts without orders
ru_ru: Используйте этот скрипт для удаления неподтвержденных аккаунтов без заказов

# Languages::cp_email_verification.after_success_registration
source: Your account has been created successfully. You will be able to log in after confirming your email address. We have sent you an email with a link to activate your account.
ru_ru: Ваш аккаунт успешно создан. Вы сможете авторизоваться после подтверждения адреса электронной почты. Мы отправили вам письмо со ссылкой для активации аккаунта.

# Languages::cp_email_verification.after_success_verification
source: Thanks for the confirmation. Your account has been activated.
ru_ru: Спасибо за подтверждение. Ваш аккаунт активирован.

# Languages::cp_email_verification.token_is_invalid
source: Your verification token is invalid.
ru_ru: Ваш токен верификации недействителен.

# Languages::cp_email_verification.verify_for_authentication
source: Your email address has not been confirmed. Please check your email.
ru_ru: Ваш адрес электронной почты не был подтвержден. Пожалуйста, проверьте Email.

source: Sending a link to email verification
ru_ru: Отправка ссылки для верификации email

# Languages::cp_email_verification.cp_email_verified
source: Verified
ru_ru: Верифицирован

# Languages::cp_email_verification.cp_unable_to_execute_command
source: Unable to execute command. Setting 'Delete unconfirmed accounts without orders' is not on
ru_ru: Невозможно выполнить команду. Настройка 'Удалять неподтвержденные аккаунты без заказов' не включена

source: Sending a link to email verification
ru_ru: Отправка ссылки для верификации email

source: Sending a link to email verification
ru_ru: Отправка ссылки для верификации email

# Languages::cp_email_verification.email_notifications_subj
source: CS-Cart: email verification
ru_ru: CS-Cart: верификация email

# Languages::cp_email_verification.you_registered
source: You have registered on [url_storefront]
ru_ru: Вы зарегистрировались на [url_storefront]

# Languages::cp_email_verification.confirm_email
source: Please confirm your email address by following the link [link_verification]
ru_ru: Пожалуйста, подтвердите адрес электронной почты перейдя по ссылке [link_verification]

# Languages::cp_email_verification.you_place_order
source: You place an order at [url_storefront]
ru_ru: Вы размещаете заказ на [url_storefront]

# Languages::cp_email_verification.you_registered_vendor
source: You have registered on [url_storefront] as a vendor.
ru_ru: Вы зарегистрировались на [url_storefront] в качестве продавца.

# Languages::cp_email_verification
source: Email verification
ru_ru: Верификация email

# Languages::cp_email_verification.event.email_notifications_user.name
source: User email verification
ru_ru: Верификация email пользователя

# Languages::cp_email_verification.event.email_notifications_guest.name
source: Email verification for guest order
ru_ru: Верификация email для гостевого заказа

# Languages::cp_email_verification.event.email_notifications_vendor.name
source: Vendor email verification
ru_ru: Верификация email продавца

# Languages::cp_email_verification.checkout.guest_verification.popup.title
source: Email address verification
ru_ru: Подтверждение адреса электронной почты

# Languages::cp_email_verification.checkout.guest_verification.popup.message
source: To make sure that your email is correct, we have sent you a message to <strong>[email]</strong>.<br/><br/>Please check your inbox and <strong>follow the link</strong> in the email.
ru_ru: Чтобы убедиться, что Email указан без ошибок, мы отправили вам сообщение на <strong>[email]</strong>.<br/><br/>Пожалуйста, проверьте входящие и <strong>перейдите по ссылке</strong> в письме.

# Languages::cp_email_verification.checkout.guest_verification.popup.warning
source: Make sure you follow the link in the message or enter a different email.
ru_ru: Убедитесь, что перешли по ссылке в сообщении либо укажите другой Email.

source: All done
ru_ru: Все готово

# Languages::cp_email_verification.checkout.guest_verification.popup.button.timer
source: Resend after [timer] sec.
ru_ru: Отправить повторно через [timer] сек.

# Languages::cp_email_verification.checkout.guest_verification.popup.button.resend
source: Resend
ru_ru: Отправить повторно
